/*
Создайте двух пользователей которые имеют доступ к базе данных shop. 

Первому пользователю shop_read должны быть доступны только запросы на 
чтение данных, второму пользователю shop — любые операции в пределах 
базы данных shop.
*/

-- Выберу БД по умолчанию (привычка).
USE gsy_shop;

/*=====================================================================================*/
/*=====================================================================================*/

-- Создаю пользователя, который может только читать данные.
-- Без пароля.
CREATE USER IF NOT EXISTS 'shop_read'@'localhost';

-- Отбираю все права, если были:
REVOKE ALL ON *.* FROM 'shop_read'@'localhost';

-- Устанавливаю права.
GRANT SELECT ON `gsy_shop`.* TO 'shop_read'@'localhost';

/*=====================================================================================*/
/*=====================================================================================*/

-- Создаю пользователя, который может все в базе `gsy_shop`.
CREATE USER IF NOT EXISTS 'shop_all'@'localhost';

-- Отбираю все права, если были:
REVOKE ALL ON *.* FROM 'shop_all'@'localhost';

-- Устанавливаю новые права.
GRANT ALL ON `gsy_shop`.* TO 'shop_all'@'localhost';
GRANT GRANT OPTION ON `gsy_shop`.* TO 'shop_all'@'localhost';


/*=====================================================================================*/
/*=====================================================================================*/

-- Удаляю пользователей.
-- DROP USER 'shop_read'@'localhost';
-- DROP USER 'shop_all'@'localhost';
