/*=====================================================================================*/
RETURN;

/*=====================================================================================*/
/* Деление */

SELECT 5 / 2;       -- 2.5
SELECT 5 DIV 2;     -- 2 (деление нацело)
SELECT 5 MOD 2;     -- 1 (остаток от деления, синоним %)

/*=====================================================================================*/
/* Логические значения*/

FALSE = 0
TRUE = 1

/*=====================================================================================*/
/* Вычисляемый столбец в таблице */

CREATE TABLE tbl (
    x INT, 
    y INT, 
    summ INT AS (x + y) -- значения не будут храниться в БД.
);

CREATE TABLE tbl (
    x INT, 
    y INT, 
    summ INT AS (x + y) STORED -- значения будут храниться в БД.
);

-- Такой 'summ' можно будет также индексировать.

/*=====================================================================================*/
/* Поиск по маске LIKE */

SELECT * FROM table_name WHERE name LIKE 'П%мм_'
-- ДА: Программа
-- ДА: Программы
-- НЕТ: Программист

/*=====================================================================================*/
/* Поиск по регулярному выражению RLIKE or REGEXP */

SELECT * FROM table_name WHERE name LIKE '^П[а-яё]{5}мм[а-яё].$'
-- ДА: Программа
-- ДА: Программы
-- НЕТ: Программист

-- [[:digit:]] -- цифры
-- [[:alpha:]] -- буквы

/*=====================================================================================*/
/* Ограниченная выборка, постраничная выдача */

SELECT * FROM table_name LIMIT 2;           -- Извлекаем две первых записи.
SELECT * FROM table_name LIMIT 4, 2;        -- Пропускаем 4, извлекаем 2.
SELECT * FROM table_name LIMIT 2 OFFSET 4;  -- Пропускаем 4, извлекаем 2.

/*=====================================================================================*/
/* Изменить значения полей */

UPDATE table_name SET number_field = number_field * 2;

/*=====================================================================================*/
/* Удалить значения из таблицы */

DELETE FROM table_name ORDER BY number_field DESC LIMIT 1; -- удалить строку с самым большим значением в поле.

/*=====================================================================================*/
/* Пример функций: */

SELECT NOW();                       -- Текущие дата/время.
SELECT DATE('2000-01-01 12:33:44'); -- Выведется только дата, без времени.
SELECT DATE_FORMAT('2000-01-01 12:33:44', 'На дворе уже %Y год') -- На дворе уже 2000 год.

/*=====================================================================================*/
/* UNIXSTAMP */

SELECT
    UNIX_TIMESTAMP('2018-10-10 10:09:23') AS Timestamp,
    FROM_UNIXTIME(1539155363) AS DATETIME;
    -- Timestamp: 1539155363
    -- Datetime: 2018-10-10 10:09:23

-- Возраст:
SELECT name, FLOOR((TO_DAYS(NOW()) - TO_DAYS(birthday_at)) / 365.25) AS age FROM users;
-- Или лучше:
SELECT name, TIMESTAMPDIFF(YEAR, birthday_at, NOW()) AS age FROM users;

/*=====================================================================================*/
/* RAND */

SELECT * FROM table_name ORDER BY RAND(); -- Вывод записей в случайном порядке.
SELECT * FROM table_name ORDER BY RAND() LIMIT 1; -- Вывод одной случайной записи.

/*=====================================================================================*/
/* Информационные функции: */

SELECT VERSION(); -- Версия MySQL
SELECT DATABASE(); -- Текущая БД.
SELECT USER(); -- Текущий пользователь.

/*=====================================================================================*/
/* Значение поля, которое было сгенерировано спомощью AUTO_INCREMENT */

1. INSERT INTO catalogs VALUES (DEFAULT, 'Processores');
2. SELECT LAST_INSERT_ID();

-- Можно использовать, как внешний ключ для связанных таблиц.

/*=====================================================================================*/
/**/

/*=====================================================================================*/
/**/

/*=====================================================================================*/
/**/

/*=====================================================================================*/
/**/

/*=====================================================================================*/
/**/

/*=====================================================================================*/
/**/