/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Переменные */

/*=====================================================================================*/
/* Локальные - только внутри BEGIN..END */
DECLARE int1, int2 INT(11) DEFAULT 0;
DECLARE txt1, txt2 VARCHAR(255);

/*=====================================================================================*/
/* Объявит и Установить или изменить значение в сессионной переменной */
SET @var1 = 100;
SET @var1 = @var1 + 1;

/*=====================================================================================*/
/* Результат запроса сохранить в переменную */

-- Должна возвращаться только одна запись.
SELECT `id`, `name` INTO @var_id, @var_name FROM table_name; 






/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Процедуры */

/*=====================================================================================*/
/* Создать процедуру (в отдельном файле) */
CREATE PROCEDURE proc_name()
BEGIN
    -- Здесь записываются SQL-команды, как обычно.
    SELECT VERSION();
END

-- Еще можно с меткой:
CREATE PROCEDURE proc_name()
proc_label: BEGIN
    -- Здесь записываются SQL-команды, как обычно.
    SELECT VERSION();
END

-- Уалить процедуру:
DROP PROCEDURE IF EXISTS proc_name;

/*=====================================================================================*/
/* Вызвать процедуру (в консоли) */
CALL proc_name;

/*=====================================================================================*/
/* Получить описание хранимых процедур */
SHOW PROCEDURE STATUS \G;

-- Или для определенных процедур:
SHOW PROCEDURE STATUS LIKE 'proc_name%' \G;

-- А для функций (все аналогично):
SHOW FUNCTION STATUS \G;

/*=====================================================================================*/
/* Можно воспользоваться таблицей хранимых процедур 'mysql.proc' */
SELECT `name`, `type` FROM mysql.proc LIMIT 10; -- Их там очень много.

/*=====================================================================================*/
/* Содержимое хранимой процедуры (после того, как она создана) */
SHOW CREATE PROCEDURE proc_name \G;

/*=====================================================================================*/
/* Параметры для процедур */

IN -- Только передаем внутрь процедуры
OUT -- Только получаем из процедуры (внутри процедуры будет равно NULL)
INOUT -- И передаем и получаем.

/*=====================================================================================*/
/* Процедура с параметром */
CREATE PROCEDURE proc_name (IN param1 INT)
BEGIN
    SET @x = value;
END

-- Вызов:
CALL proc_name (12345);

/*=====================================================================================*/
/* Локальные переменные */
CREATE PROCEDURE proc_name (IN param1 INT)
BEGIN
    DECLARE int1, int2 INT(11) DEFAULT 0;
    DECLARE txt1, txt2 VARCHAR(255);
    -- ...
    -- Будут видны только внутри этого блока.
END






/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Функции - все очень похоже на то, как у процедур */
/* Параметры в скобках при вызове функции всегда только входные */

/*=====================================================================================*/
/* Получить описание хранимых функций: */
SHOW FUNCTION STATUS \G;
SHOW FUNCTION STATUS LIKE 'proc_name%' \G;

/*=====================================================================================*/
/* Удалить функцию */
DROP FUNCTION `function_name`;

/*=====================================================================================*/
/* Создать функцию (в отдельном файле) */
CREATE FUNCTION `function_name`()
RETURNS VARCHAR(255) DETERMINISTIC -- Одно и то же значение всегда (можно кэшироваь).
BEGIN
    RETURN VERSION();
END 

-- Или...
CREATE FUNCTION `function_name`()
RETURNS VARCHAR(255) NOT DETERMINISTIC
BEGIN
    -- Какие-то расчеты.
    -- Заведомо результат не определен.
    RETURN value_varchar_255;
END 

/*=====================================================================================*/
/* Вызов функции */
SET @value = function_name();

-- Или:
SELECT function_name();






/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Ветвления */
CREATE PROCEDURE proc_name (IN param1 INT)
BEGIN
    IF(param1 = 123) THEN
        SET @var1 = param1 + 1;
        SET @var2 = @var1 + 2;
        -- Еще какие-то действия...
    END IF;
END

/*=====================================================================================*/
/* IF..ELSE... */
/* IF..ELSEIF..ELSE... */
CREATE PROCEDURE proc_name (IN param1 TEXT)
BEGIN
    IF(param1 = 'one') THEN
        SET @var1 = param1 + 1;
        -- Еще какие-то действия...
    ELSEIF (param1 = 'two') THEN
        SET @var1 = param1 + 2;
        -- Еще какие-то действия...
    ELSE
        SET @var2 = @var1 + 2;
        -- Еще какие-то действия...
    END IF;
END

/*=====================================================================================*/
/* CASE */
CREATE PROCEDURE proc_name (IN param1 TEXT)
BEGIN
    CASE param1
        WHEN '1st' THEN
            SET @var1 = 'some value';
            -- Еще какие-то действия...
        WHEN '2nd' THEN
            SET @var2 = 'some value';
            -- Еще какие-то действия...
        WHEN '3rd' THEN
            SET @var3 = 'some value';
            -- Еще какие-то действия...
        ELSE
            SET @var = 'other case';
            -- Еще какие-то действия...
    END CASE;
END






/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Дополнительная и полезная информация */

/*=====================================================================================*/
/* Установить команду "окончание запроса" вместо ';' */
DELIMITER delim_word

-- И теперь запрос следует записывать так:
SELECT * FROM table_name delim_word

-- В конце лучше вернуть, как было:
DELIMITER ;

/*=====================================================================================*/
/* Пример с процедурой (с функцией тоже будет работать) */

DELIMITER //
CREATE PROCEDURE proc_name()
BEGIN
    SELECT VERSION();
END //
DELIMITER ;

CALL proc_name;

/*=====================================================================================*/
/* COALESCE */

-- Возращает первое NOT NULL значение в переданном наборе:
SET @var1 = COALESCE(@var2, @var3, @varN);






/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Циклы и Курсоры */

-- Используются только в теле процедуры или функции.

/*=====================================================================================*/
/* WHILE..END WHILE */
CREATE PROCEDURE proc_name (IN param1 INT)
BEGIN
    DECLARE i INT DEFAULT 10;
    WHILE i > 0 DO 
        SET i = i - 1;
        -- Еще какие-нибудь действия...
        -- Еще какие-нибудь действия...
    END WHILE;

    -- Другой цикл (с меткой):
    2nd: WHILE i < param1 DO 
        SET i = i + 1;
        -- Еще какие-нибудь действия...
        -- Еще какие-нибудь действия...
        IF i > 100 THEN
            LEAVE 2nd;  -- Досрочный выход.
        END IF;
    END WHILE 2nd;

    -- А здесь мы пропускаем итерации:
    3rd: WHILE i < 1000 DO 
        SET i = i + 1;
        -- Еще какие-нибудь действия...
        IF i < 100 THEN
            ITERATE 3nd;  -- Досрочный переход к следующей итерации.
        END IF;
        -- Еще какие-нибудь действия...
    END WHILE 3rd;
END

-- Чтобы покинуть цикл принудительно, используется команда:
LEAVE cycle_name;

-- Чтобы покинуть итерацию цикла и перейти к следующей:
ITERATE cycle_name;

/*=====================================================================================*/
/* REPEAT..UNTIL..END REPEAT */
CREATE PROCEDURE proc_name (IN param1 INT)
BEGIN
    DECLARE i INT DEFAULT 10;
    REPEAT
        SET i = i - 1;
        -- Еще какие-нибудь действия...
        -- Еще какие-нибудь действия...
    UNTIL i > 0
    END REPEAT;
END

/*=====================================================================================*/
/* LOOP..END LOOP; */
CREATE PROCEDURE proc_name (IN param1 INT)
BEGIN
    DECLARE i INT DEFAULT 10;
    1st: LOOP
        SET i = i - 1;
        IF i > 0 THEN
            LEAVE 1st;  -- Это обычный выход из этого цикла.
        END IF;
        -- Еще какие-нибудь действия...
        -- Еще какие-нибудь действия...
    END LOOP 1st;
END






/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Обработчики ошибок */

DECLARE CONTINUE HANDLER FOR SQLSTATE 'err_number' SET @error = 'Описание ошибки';

/*=====================================================================================*/
/* Пример обработки */

CREATE PROCEDURE proc_name (IN param1 INT, IN param2 VARCHAR(255))
BEGIN
    -- Объявляем обработчик:
    DECLARE CONTINUE HANDLER FOR SQLSTATE 'err_number' SET @error = 'Описание ошибки';
    -- Выполняем действие:
    INSERT INTO table_name(field1, field2) VALUES(param1, param2);
    -- Проверяем наличие ошибки:
    IF @error IS NOT NULL THEN
        -- Обрабтатываем ошибку:
        SELECT @error;
    END IF;
END






/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Курсоры */
-- Должен соблюдаться строгий порядок:
    -- 1. Объявление курсора;
    DECLARE cursor_name CURSOR FOR SELECT * FROM table_name;
    -- 2. Открытие курсора;
    OPEN cursor_name;
    -- 3. Чтение данных курсором (многократно, можно в цикле);
    FETCH cursor_name INTO field1, field2;
    -- 4. Закрытие курсора.
    CLOSE cursor_name;

/*=====================================================================================*/
/* Пример использования курсора */
CREATE PROCEDURE proc_name (IN param1 INT, IN param2 VARCHAR(255))
BEGIN
    DECLARE var1 INT;
    DECLARE var2 TEXT;
    DECLARE is_end INT DEFAULT 0;

    -- Объявляем курсор:
    DECLARE cursor_name CURSOR FOR SELECT field1, field2 FROM table_name;
    -- Объявляем обработчик ошибки:
    DECLARE CONTINUE HANDLER FOR NOT FOUND SET is_end = 1;

    -- Открываем курсор:
    OPEN cursor_name;

    -- Читаем данные:
    1st: LOOP
        FETCH cursor_name INTO var1, var2;
        IF is_end THEN 
            LEAVE 1st;
        END IF;
        -- Делаем, что-нибудь с почитанными данными.
        -- Которые теперь хранятся в переменных.
    END LOOP 1st;

    -- Обязательно не забываем закрыть курсор!!!
    CLOSE cursor_name;
END





/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Триггер */

-- Команды, к которым можно привязать триггер:
    -- INSERT
    -- UPDATE
    -- DELETE
-- Триггеры могут выполняться "BEFORE" и "AFTER" каждой из этих команд.
-- Значения в триггерах:
    -- BEFORE NEW.field_name
    -- AFTER OLD.field_name

/*=====================================================================================*/
/* Удалить триггер */
DROP TRIGGER IF EXISTS trigger_name;

/*=====================================================================================*/
/* Создать триггер */
CREATE TRIGGER trigger_name AFTER INSERT ON table_name
FOR EACH ROW
BEBIN
    -- Какие-нибудь действия;
    -- Точно как в процедурах.
END

/*=====================================================================================*/
/* Получить список триггеров */
SHOW TRIGGERS \G;

/*=====================================================================================*/
/* Пример использования */
CREATE TRIGGER trigger_name BEFORE INSERT ON table_name
FOR EACH ROW
BEBIN
    DECLARE var1 INT;
    -- Здесь, если в новой записи поле 'field1' не заполнено.
    -- Тогда оно заполняется значением из переменной 'var1';
    SELECT field1 INTO var1 FROM table_name ORDER BY field1 LIMIT 1;
    SET NEW.field1 = COALESCE(NEW.field1, var1);
END

-- Или немного иначе:
CREATE TRIGGER trigger_name BEFORE UPDATE ON table_name
FOR EACH ROW
BEBIN
    DECLARE var1 INT;
    -- Здесь, если в новой записи поле 'field1' не заполнено.
    -- И старое значение 'field1' тоже было пустым.
    -- Тогда оно заполняется значением из переменной 'var1';
    SELECT field1 INTO var1 FROM table_name ORDER BY field1 LIMIT 1;
    SET NEW.field1 = COALESCE(NEW.field1, OLD.field1, var1);
END

-- А так можно блокировать выполнение запросов:
CREATE TRIGGER trigger_name BEFORE DELETE ON table_name
FOR EACH ROW BEBIN
    DECLARE var_total INT;
    -- Узнаем, сколько сейчас записей в таблице.
    SELECT COUNT(*) INTO var_total FROM table_name;
    -- Не позволим удалить последнюю.
    IF var_total <= 1 THEN
        SIGNAL SQLSTATE '45000' SET MESSAGE_TEXT = 'Удаление отменено';
    END IF;
END
