EXIT;
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Транзакции */

/*=====================================================================================*/
/* Начать выбор команд, объединненых в транзакцию */
START TRANSACTION;

/*=====================================================================================*/
/* Применить транзакцию */
COMMIT;

-- Все точки сохрения удаляются.

/*=====================================================================================*/
/* Отменить транзакцию */
ROLLBACK;

-- Все точки сохрения удаляются.

/*=====================================================================================*/
/* Создать (или перезаписать) точку сохранения */
SAVEPOINT save_point_name;

/* Откатить изменения к точке сохранения */
ROLLBACK TO SAVEPOINT save_point_name.

/*=====================================================================================*/
/* Отключить автоматическое применение транзакций */

SET AUTOCOMMIT=0;

-- Теперь изменения не будут сохраняться в БД без явной команды COMMIT.
-- Каждая новая команда будет являться частью одной транзакции.

SET AUTOCOMMIT=1;

-- Теперь все работает как и прежде.
-- MySQL сохраняет каждую команду, как отдельную транзакцию.

/*=====================================================================================*/
/* Уровни изоляции транзакций */

READ UNCOMMITTED;   -- Транзакции могут видеть не сохраненные, другие транзакции.
READ COMMITTED;     -- Видит только изменения, зафиксированные другими транзакциями.
REPEATABLE READ;    -- По умолчанию.
SERIALIZABLE;       -- Блокирует каждую строку, которую транзакция читает.

/*=====================================================================================*/
/* Изменить уровень изоляции */

SET TRANSACTION ISOLATION LEVEL READ COMMITTED;




/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Переменные */

/*=====================================================================================*/
/* Создание сессионной переменной */

SELECT @var_name := COUNT(*) FROM table_name;

-- Другой вариант.
SET @var_name = NOW() - INTERVAL 7 DAY;

/*=====================================================================================*/
/* Отобразить список системных переменных */

SHOW VARIABLES;
SHOW VARIABLES LIKE 'var_name_%';

/*=====================================================================================*/
/* Изменить глобальную переменную */

SET GLOBAL 'read_buffer_size' = 2097152;

-- Другой вариант.
SET @@global.read_buffer_size = 2097152;

/*=====================================================================================*/
/* Изменить значение сессионной переменной */

SET SESSION 'read_buffer_size' = 2097152;

-- Другой вариант.
SET @@session.read_buffer_size = 2097152;

-- Присвоить значение из глобальной.
SET read_buffer_size = DEFAULT;




/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Временные таблицы и динамические запросы */

/*=====================================================================================*/
/* Создание временной таблицы */

CREATE TEMPORARY TABLE `table_name` (
    `id`    SERIAL,
    `name`  VARCHAR(255),
    ...
);

SHOW TABLES;            -- Не покажет эту табицу.
DESCRIBE `table_name`;  -- Покажет описание таблицы.

/*=====================================================================================*/
/* Создать динамический запрос (для сессии) */

PREPARE dynamic_request FROM 'SELECT VERSION()';

-- Выполнить:
EXECUTE dynamic_request;

/*=====================================================================================*/
/* Динамический запрос с параметром. */

-- Параметр всегда передает значение В ВИДЕ СТРОКИ.
-- Как и остальное тело динамического запроса.
PREPARE dynamic_request 
    FROM 'SELECT id, prm1, prm2 FROM table_name WHERE prm1 = ? AND prm2 = ?';

-- Подготовим переменные:
SET @parameter_1 = 111;     -- Станет строкой.
SET @parameter_2 = 222;     -- Станет строкой.

-- Выполним:
EXECUTE dynamic_request USING @parameter_1, @parameter_2;

/*=====================================================================================*/
/* Удалить запрос */

DROP PREPARE dynamic_request;




/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Представления (ракурсы) */

/*=====================================================================================*/
/* Создать представление */

CREATE VIEW view_name1 AS SELECT * FROM table_name;

-- Лучше так:
CREATE OR REPLACE VIEW view_name2 AS SELECT * FROM table_name;

-- Или даже так:
CREATE OR REPLACE VIEW view_name3 AS 
    SELECT * 
    FROM table_name
    WHERE prm1 = 111 AND prm2 = 222;

SHOW TABLES; -- Покажет представление, как таблицу.

-- Алгоритм формирования конечного запроса:
-- MERGE - Представление замещает соотв. части в запросе.
-- TEMPTABLE - Результат помещается во временную таблицу.
-- UNDEFINED - По умолчанию. Автоматическое определение.

-- ВЕРТИКАЛЬНОЕ - Выборка не всех столбцов таблицы.
-- ГОРИЗОНТАЛЬНОЕ - Выборка не всех записей таблицы.

/*=====================================================================================*/
/* Создать обновляемое представление */

CREATE OR REPLACE VIEW view_name AS
    SELECT * 
    FROM table_name
    WHERE prm1 = 111 AND prm2 = 222
    WITH CHECK OPTION;

-- Изменения будут проходить проверку на удовлетворение
-- части 'WHERE' в запросе представления.

/*=====================================================================================*/
/* Отредактировать представление */

ALTER VIEW view_name AS
    SELECT * 
    FROM table_name
    WHERE prm2 > 222
    WITH CHECK OPTION;

-- Или можно использовать: CREATE OR REPLACE VIEW.

/*=====================================================================================*/
/* Удалить представления */

DROP VIEW IF EXISTS view_name1, view_name2, view_name3;




/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Прочее */

/*=====================================================================================*/
/* Параметры журнала транзакций */

SHOw VARIABLES LIKE 'innodb_log_%'; -- LIKE работает как в обычном запросе. По маске.

/*=====================================================================================*/
/* Путь к каталогу данных в системе */

SHOW VARIABLES LIKE 'datadir';

/*=====================================================================================*/
/* Переменная для управления режимом сохранения журнала транзакций */

SHOW VARIABLES LIKE 'innodb_flush_log_at_trx_commit';
-- 0 - Сохранение журнала раз в секунду.
-- 1 - Сохранение после каждой транзакции.
-- 2 - Сохранение раз в секунду и после каждой транзакции.

-- Изменить режим.
SET GLOBAL innodb_flush_log_at_trx_commit = 0;
