EXIT;
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Движок (система хранения) данных таблиц */

...ENGINE=InnoDB;

-- Например:
CREATE TABLE IF NOT EXISTS table_name (
    id SERIAL PRIMARY KEY,
    name VARCHAR(255)
) ENGINE=InnoDB;

-- Распространяются:
    -- InnoDB 
        -- Транзакционная обработка. 
        -- Автоматическое восстановление после сбоя.
        -- Поддерживает внешние ключи.
        -- Поддреживает блокировку на уровне строк.
        -- Не кэширует информацию о количестве строк в таблицах.
    -- MyISAM
        -- Не поддерживает транзакции.
        -- Табличная блокировка.
        -- 
    -- Memory
        -- Полностью расположене в RAM.
        -- Не поддерживают транзакции.
        -- При перезапуске содержимое таблиц обнуляется.
        -- Максимально быстрая.
    -- Archive
        -- Только команды INSERT и SELECT.
        -- Потребляют очень мало RAM.
        -- Данные сжимаются, сокращается ввод и вывод (в объеме).
        -- Эффективно для протоколов/логов.
        -- Блокировка на уровне строк.
        -- Не поддерживает транзакции.
        -- Высокоскоростная вставка.
    -- BlackHole
        -- Не содержит данных.
        -- Операции фиксируются только в бинарном журнале (не на диске)
    -- MRG_MyISAM
        --
    -- CSV
        -- Текстовые файлы, как таблицы.
        -- Легко сохраняются из EXCEL-таблиц.

/*=====================================================================================*/
/* Путь к каталогу данных MySQL */
SHOW VARIABLES LIKE 'datadir';

/*=====================================================================================*/
/* Файлы БД */

InnoDB:
-- *.frm -- Файлы со структурами данных.
-- *.ibd -- Файлы с данными.
-- *.trn -- Файлы для обеспечения работы триггеров.

MyISAM:
-- *.frm -- Файлы со структурами данных.
-- *.myd -- Файлы с данными.
-- *.myi -- Файлы с индексаи.

/*=====================================================================================*/
/* Настройки для таблицы */
SHOW TABLE STATUS LIKE 'catalogs' \G;

/*=====================================================================================*/
/* Список поддерживаемых движков: */
SHOW ENGINES \G;

/*=====================================================================================*/
/* Объем RAM, занятый под индексы MyISAM */
SHOW VARIABLES LIKE 'key%';

-- Оценить эффективность этого кэша:
SHOW STATUS LIKE 'key%';

/*=====================================================================================*/
/* Узнать, какие решения принимает оптимизатор */
EXPLANE SELECT field1, field2 FROM table_name ORDER BY field1 \G;

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */