АДМИНИСТРИРОВАНИЕ MySQL.

EXIT;

/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Узнать параметры запуска MySQL */
ps aux | grep mysqld;

--basedir - место установки сервера MySQL.
--datadir - место расположение каталога данных.
--log-error - лог файл для ошибок.

-- Полный список параметров запуска сервера.
mysqld --verbose -- help;

/*=====================================================================================*/
/* Пример содержимого файла '.my.cnf' или '.my.ini' */
[mysqld]
# Only allow connection from localhost
bind-address = 127.0.0.1
port = 3308
tmp_table_size = 32M

-- Чтобы заработали изменения, нужно перезапустить сервер:
service mysql stop;
service mysql start;

-- Или так:
service mysql restart;


/*=====================================================================================*/
/* Глобальные переменные (параметры) MySQL */
SHOW VARIABLES LIKE 'date%_format';

-- Узнать уровень изоляции транзакций:
SHOW VARIABLES LIKE 'tx_isolation';

-- Установить значение для сессии:
SET SESSION  tmp_table_size = 16777216;

-- Установить значение для сервера.
-- Сработает после переподключения клиента к серверу.
-- Но как только сервер перезапустится, то значение снова будет взято из '.my.cnf'.
SET GLOBAL  tmp_table_size = 16777216;

/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Журнал ошибок, путь к файлу журнала */
SHOW VARIABLES LIKE 'log_error%';

/*=====================================================================================*/
/* Общий журнал запросов */
SHOW VARIABLES LIKE 'general_log%';

-- .my.cnf
[mysqld]
general_log = ON

-- Перезапустить сервер.

/*=====================================================================================*/
/* Журнла медленных запросов */
SHOW VARIABLES LIKE 'slow_query_log%';

-- Время для медленных запросов:
SHOW VARIABLES LIKE 'long_query_time';

/*=====================================================================================*/
/* Функция benchmark, для измерения времени выполнения */
SET @times = 1000000000; -- сколь раз выполним запрос.
SELECT BENCHMARK(@times, (SELECT COUNT(*) FROM table_name));

-- Вывод лога медленных запросов:
mysqldumpslow mac422rih-slow.log; -- это файл журнала.

/*=====================================================================================*/
/* Вид хранения логов */
SHOW VARIABLES LIKE 'log_output'; -- TABLE / FILE (default) / NONE

-- .my.cnf
[mysqld]
general_log = ON
log_output = TABLE

-- Перезагружаем сервер, запускаем клиент и...
SET @times = 1000000000;
SELECT BENCHMARK(@times, (SELECT COUNT(*) FROM table_name));
SELECT * FROM mysql.slow_log \G;

/*=====================================================================================*/
/* Бинарный журнал, регистрирует изменения в БД */
SHOW VARIABLES LIKE 'log_bin';

-- .my.cnf
[mysqld]
log_bin = ON
server-id = 1

-- Запускаем сервер.
-- Видим два новых файла в каталоге данных:
ON.000001 -- бинарный журнал.
ON.index -- список всех бинарных жуналов.

-- Читаем бинарный журнал:
mysqlbinlog ON.000001;

/*=====================================================================================*/
/* Количество соединений, которое может обслуживать сервер */
SHOW VARIABLES LIKE 'max_connections';

-- Отслеживать соединения:
SHOW PROCESSLIST;

-- Прервать соединение с сервером MySQL:
KILL 2;

/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/*=====================================================================================*/
/* Создать учетную запись */
CREATE USER user_name;
CREATE USER user_name IDENTIFIED WITH sha256_password BY 'password'; -- с паролем.

-- Зайдем под новым пользователем:
mysql -u user_name -p 

-- Узнаем свою учетную запись:
SELECT USER();

-- Узнаем всех пользователей в БД:
SELECT Host, User FROM mysql.user;

-- Переименовать пользователя:
RENAME USER user_name TO new_user_name;

-- Удалить учетную запись:
DROP USER user_name;
-- После этого не забудем закрыть его соединение.
-- Этот пользователь уже не сможет переподключиться к серверу.

-- Имя пользователя:
'user_name'@'localhost' -- пользователь может подключаться только из localhost.
'user_name'@'%' -- пользователь может подключаться из любого хоста.

/*=====================================================================================*/
/* Привилегии */

-- Создать пользователя с полными правами на сервере на все таблицы всех БД.
GRANT ALL ON *.* TO 'user_name'@'host_name' IDENTIFIED WITH sha256_password BY 'password';

-- Отобрать права на все таблицы всех БД:
REVOKE ALL ON *.* FROM 'user_name'@'localhost';

-- Дать привилегии на просмотр, изменение и удаление таблиц:
GRANT SELECT, INSERT, UPDATE, DELETE ON *.* TO user_name;

-- Дать все привилегии, 'ALL' - всегда отдельно:
GRANT ALL ON *.* TO user_name;

-- Дать возможность присваивать привилегии себе другим:
GRANT GRANT OPTION ON *.* TO user_name;

-- Забрать все привилегии, но добавить SELECT:
GRANT USAGE, SELECT ON *.* TO user_name;

-- Дать привилегии только для одной таблицы одной БД:
GRANT ALL ON db_name.table_name TO user_name;

-- Дать читать и изменять только определенные столбцы таблицы:
GRANT SELECT (id, name), UPDATE (name) ON db_name.table_name TO user_name;

/*=====================================================================================*/
/* Просмотр привилегий */
SHOW GRANTS;

-- Еще привилегии:
GRANT ALL ON db_name.* TO 'user_name'@'host_name' IDENTIFIED 
WITH sha256_password BY 'password'
WITH MAX_CONNECTIONS_PER_HOUR 10    -- Не больше 10 подключений к серверу в час.
     MAX_QUERIES_PER_HOUR 1000      -- Не больше 1000 запросов в час.
     MAX_UPDATES_PER_HOUR 200       -- Не больше 200 изменений в час.
     MAX_USER_CONNECTIONS 3;        -- Не больше 3 одновременных подключений.

-- Если значения равны 0 - значит на этот параметр ограничений нет.

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */

/*=====================================================================================*/
/*  */
