package player

import (
	"bufio"
	"fmt"
	"net"
)

// Структура игрока на сервере.
type Structure struct {
	Name       string
	Connection net.Conn
	Answering  chan string
}

// ============================================================================
// ============================================================================
// ============================================================================

// Отправить сообщение игроку на клиент.
func (plr *Structure) Send(msg string) {
	fmt.Fprint(plr.Connection, msg)
}

// ============================================================================
// ============================================================================
// ============================================================================

// Начать процес принятия ответов игрока на игровые задачи.
func (plr *Structure) startAnswering() {
	var msg = bufio.NewScanner(plr.Connection)

	defer close(plr.Answering)
	for msg.Scan() {
		plr.Answering <- msg.Text()
	}
}
